# Problem - 2

library(UsingR)

x1970 = homedata$y1970

x2000 = homedata$y2000

# а)
max(x2000) # Най - скъпата къща през 2000г.
min(x2000) # Най - евтината

x1970[which.max(x2000)] # which.max връщата индекса на най-скъпата къща през 2000г

[1] 198900

# Аналогично за min
x1970[which.min(x2000)]

# б) За да вземем най - скъпите, искаме да ги сортираме в намаляващ ред ===>

sort(x2000, decreasing = T) [1:5] # и след това вземаме първите 5

# в) Броят на къщите, по - скъпи от 750 000

sum(x2000 > 750000)

# г) Средната цена през 1970г. на тези от в) 
mean(x1970[x2000 > 750000])

# д)

# x2000<1970 връща индексите на тези които през 2000г. имат по - ниска цена от 1970
# в случая е само една такава къща
x2000[x2000 < x1970]

# е) 10-те къщи с най - голямо процентно увеличение

order( ( x2000 - x1970 ) / x2000, decreasing = T ) [ 1 : 10 ]

# Обяснение: От къщите от 2000г. вадим тези от 1970г. , за да видим колко е разлиакта
# След това като разделим получените разлики на първоначалните им цени ( x2000 )
# Ще разберем процентното увеличение, накрая ги сортираме в намаляващ ред
# Защото искаме да взмем тези с най - голямо процентно увеличение и вземаме първите 10



# Забележка: Задача 3 от тази Седмица 1 е 1:1 към 1зад. от Седмица-2,
# така, че решението й ще бъде разгледано там.

