# Problem 1

Vec = c(8, 3, 8, 7, 15, 9, 12, 4, 9, 10, 5, 1)

# Правим матрица 4x3

M = matrix(Vec, nrow = 4) # Може да подадем и ncol = 3, но се подразбира в този случай

rownames(M) = c('Row1', 'Row2', 'Row3', 'Row4')

M

[,1] [,2] [,3]
Row1    8   15    9
Row2    3    9   10
Row3    8   12    5
Row4    7    4    1

# С командата rbind можем да добавим нов ред, а с cbind - нова колона

M = cbind(M,c(1,3,5,7))

M

[,1] [,2] [,3] [,4]
Row1    8   15    9    1
Row2    3    9   10    3
Row3    8   12    5    5
Row4    7    4    1    7

# Функцията order ни връща индексите на сортиран ( в нарастващ ред ) вектор

# Сортираме по 1-ва колона в нарастващ ред:
M.colSorted = M[order(M[ ,1]), ]

# Сортираме по първите 2 колони в нарастващ ред:
M.firstTwoColsSorted = M[ order(M[ ,1], M[ ,2] ), ]


