# Problem 6
# Проверка дали данни са експоненциално разпределени

Data = scan()

# H0: x принадлежи на exp ( lambda = 2 )
# H1 : !H0

max(Data) # 3.014126


# Сега правим интервали
# Имаме общо 120 наблюдения ( данните от data.txt )
# Добре е да направим 4 интервала
# Броят на наблюдения във всеки интервал (di) е добре да е над 20
# затова 4 интервала е добра идея
# Идеята е 120 / 4 = 30 т.е. по 30 на 1 интервал може да се паднат

intervals = seq(0 , 3.014, length.out = 5)

[1] 0.0000 0.7535 1.5070 2.2605 3.0140
# 5 числа образуват 4 интервала

P = pexp(intervals[2],2) # intervals[2], защото няма как да запишем 0

[1] 0.7784263

P[2] =  pexp(intervals[3], 2) - pexp(intervals[2], 2)
P[3] =  pexp(intervals[4], 2) - pexp(intervals[3], 2)
P[4] =  1 - sum(P[1:3])

P = P[1:4]
P
[1] 0.77842630 0.17247880 0.03821677 0.01087814

# Показваме как са разпределени данните с интервали с 'cut'

int = cut(Data, intervals)

# Правим таблица

t = table(int)
int
(0,0.753] (0.753,1.51]  (1.51,2.26]  (2.26,3.01] 
93           19            7            0

t[4] = 1
int
(0,0.753] (0.753,1.51]  (1.51,2.26]  (2.26,3.01] 
93           19            7            1

chisq.test(t, p = P)


Chi-squared test for given probabilities

data:  t
X-squared = 1.4831, df = 3, p-value = 0.6862

Warning message:
  In chisq.test(t, p = P) : Chi-squared approximation may be incorrect

# ===> H0 ( експоненциално разпределени са)
