# Problem 4
# Взета директно от примера в 'SimpleR' , глава 'Хи-квадрат тестове'
# Друг вид Hi^2 тест ( тест за независимост ) 

# X и Y
# H0 : X _||_ Y - независими са ( коланите не влияят )
# H1: ! H0 , зависими са (коланите влияят )


WithBelt = c(12813, 647, 359, 42) 
WoBelt = c(65963, 4000, 2642, 303)

# 1 начин - да направим матрица с 2 реда, подредена по редове по следния начин:
# 2 начин - вкарваме векторите в data.frame ( data.frame (WithBelt, WoBelt) ) и после в chisq.test-a

# Ще го направим с 1 начин

m = matrix(c(WithBelt, WoBelt), nrow = 2, byrow = T)

[,1] [,2] [,3] [,4]
[1,] 12813  647  359   42
[2,] 65963 4000 2642  303

prop.table(m) # маргинална таблица ( съвместно разпределение ). Не се изисква в условието, но е хубаво да забележим

[,1]       [,2]        [,3]         [,4]
[1,] 0.1476679 0.00745658 0.004137422 0.0004840438
[2,] 0.7602139 0.04609941 0.030448663 0.0034920306

prop.table(m,1)

[,1]       [,2]       [,3]        [,4]
[1,] 0.9243922 0.04667773 0.02590001 0.003030084
[2,] 0.9047430 0.05486366 0.03623745 0.004155923

chisq.test(m)

Pearson's Chi-squared test

data:  m
X-squared = 59.224, df = 3, p-value = 8.61e-1

# ===> H1 ( коланите влияят )
